Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/DMA_356.0.xml
<module id="DMA" HW_revision="356.0">
    <register id="DMA_DEVICE_CFG" width="32" offset="0x0" internal="0" description="Device Configuration Status">
        <bitfield id="NUM_DMA_CHANNELS" description="Number of DMA channels available" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="NUM_SRC_PER_CHANNEL" description="Number of DMA sources per channel" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="DMA_SW_CHTRIG" width="32" offset="0x4" internal="0" description="Software Channel Trigger Register">
        <bitfield id="CH0" description="Write 1, triggers DMA_CHANNEL0" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH1" description="Write 1, triggers DMA_CHANNEL1" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH2" description="Write 1, triggers DMA_CHANNEL2" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH3" description="Write 1, triggers DMA_CHANNEL3" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH4" description="Write 1, triggers DMA_CHANNEL4" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH5" description="Write 1, triggers DMA_CHANNEL5" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH6" description="Write 1, triggers DMA_CHANNEL6" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH7" description="Write 1, triggers DMA_CHANNEL7" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH8" description="Write 1, triggers DMA_CHANNEL8" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH9" description="Write 1, triggers DMA_CHANNEL9" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH10" description="Write 1, triggers DMA_CHANNEL10" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH11" description="Write 1, triggers DMA_CHANNEL11" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH12" description="Write 1, triggers DMA_CHANNEL12" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH13" description="Write 1, triggers DMA_CHANNEL13" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH14" description="Write 1, triggers DMA_CHANNEL14" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH15" description="Write 1, triggers DMA_CHANNEL15" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH16" description="Write 1, triggers DMA_CHANNEL16" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH17" description="Write 1, triggers DMA_CHANNEL17" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH18" description="Write 1, triggers DMA_CHANNEL18" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH19" description="Write 1, triggers DMA_CHANNEL19" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH20" description="Write 1, triggers DMA_CHANNEL20" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH21" description="Write 1, triggers DMA_CHANNEL21" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH22" description="Write 1, triggers DMA_CHANNEL22" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH23" description="Write 1, triggers DMA_CHANNEL23" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH24" description="Write 1, triggers DMA_CHANNEL24" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH25" description="Write 1, triggers DMA_CHANNEL25" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH26" description="Write 1, triggers DMA_CHANNEL26" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH27" description="Write 1, triggers DMA_CHANNEL27" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH28" description="Write 1, triggers DMA_CHANNEL28" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH29" description="Write 1, triggers DMA_CHANNEL29" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH30" description="Write 1, triggers DMA_CHANNEL30" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH31" description="Write 1, triggers DMA_CHANNEL31" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH0_SRCCFG" width="32" offset="0x10" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH1_SRCCFG" width="32" offset="0x14" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH2_SRCCFG" width="32" offset="0x18" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH3_SRCCFG" width="32" offset="0x1C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH4_SRCCFG" width="32" offset="0x20" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH5_SRCCFG" width="32" offset="0x24" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH6_SRCCFG" width="32" offset="0x28" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH7_SRCCFG" width="32" offset="0x2C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH8_SRCCFG" width="32" offset="0x30" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH9_SRCCFG" width="32" offset="0x34" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH10_SRCCFG" width="32" offset="0x38" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH11_SRCCFG" width="32" offset="0x3C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH12_SRCCFG" width="32" offset="0x40" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH13_SRCCFG" width="32" offset="0x44" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH14_SRCCFG" width="32" offset="0x48" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH15_SRCCFG" width="32" offset="0x4C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH16_SRCCFG" width="32" offset="0x50" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH17_SRCCFG" width="32" offset="0x54" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH18_SRCCFG" width="32" offset="0x58" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH19_SRCCFG" width="32" offset="0x5C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH20_SRCCFG" width="32" offset="0x60" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH21_SRCCFG" width="32" offset="0x64" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH22_SRCCFG" width="32" offset="0x68" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH23_SRCCFG" width="32" offset="0x6C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH24_SRCCFG" width="32" offset="0x70" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH25_SRCCFG" width="32" offset="0x74" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH26_SRCCFG" width="32" offset="0x78" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH27_SRCCFG" width="32" offset="0x7C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH28_SRCCFG" width="32" offset="0x80" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH29_SRCCFG" width="32" offset="0x84" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
