Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/DMA_356.0.xml
    <register id="DMA_CH30_SRCCFG" width="32" offset="0x88" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CH31_SRCCFG" width="32" offset="0x8C" internal="0" description="Channel n Source Configuration Register">
        <bitfield id="DMA_SRC" description="Device level DMA source mapping to channel input" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_INT1_SRCCFG" width="32" offset="0x100" internal="0" description="Interrupt 1 Source Channel Configuration">
        <bitfield id="INT_SRC" description="Controls which channel&apos;s completion event is mapped as a source of this Interrupt" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="EN" description="Enables DMA_INT1 mapping" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_INT2_SRCCFG" width="32" offset="0x104" internal="0" description="Interrupt 2 Source Channel Configuration Register">
        <bitfield id="INT_SRC" description="Controls which channel&apos;s completion event is mapped as a source of this Interrupt" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="EN" description="Enables DMA_INT2 mapping" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_INT3_SRCCFG" width="32" offset="0x108" internal="0" description="Interrupt 3 Source Channel Configuration Register">
        <bitfield id="INT_SRC" description="Controls which channel&apos;s completion event is mapped as a source of this Interrupt" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="EN" description="Enables DMA_INT3 mapping" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_INT0_SRCFLG" width="32" offset="0x110" internal="0" description="Interrupt 0 Source Channel Flag Register">
        <bitfield id="CH0" description="Channel 0 was the source of DMA_INT0" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH1" description="Channel 1 was the source of DMA_INT0" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH2" description="Channel 2 was the source of DMA_INT0" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH3" description="Channel 3 was the source of DMA_INT0" begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH4" description="Channel 4 was the source of DMA_INT0" begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH5" description="Channel 5 was the source of DMA_INT0" begin="5" end="5" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH6" description="Channel 6 was the source of DMA_INT0" begin="6" end="6" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH7" description="Channel 7 was the source of DMA_INT0" begin="7" end="7" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH8" description="Channel 8 was the source of DMA_INT0" begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH9" description="Channel 9 was the source of DMA_INT0" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH10" description="Channel 10 was the source of DMA_INT0" begin="10" end="10" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH11" description="Channel 11 was the source of DMA_INT0" begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH12" description="Channel 12 was the source of DMA_INT0" begin="12" end="12" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH13" description="Channel 13 was the source of DMA_INT0" begin="13" end="13" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH14" description="Channel 14 was the source of DMA_INT0" begin="14" end="14" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH15" description="Channel 15 was the source of DMA_INT0" begin="15" end="15" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH16" description="Channel 16 was the source of DMA_INT0" begin="16" end="16" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH17" description="Channel 17 was the source of DMA_INT0" begin="17" end="17" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH18" description="Channel 18 was the source of DMA_INT0" begin="18" end="18" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH19" description="Channel 19 was the source of DMA_INT0" begin="19" end="19" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH20" description="Channel 20 was the source of DMA_INT0" begin="20" end="20" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH21" description="Channel 21 was the source of DMA_INT0" begin="21" end="21" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH22" description="Channel 22 was the source of DMA_INT0" begin="22" end="22" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH23" description="Channel 23 was the source of DMA_INT0" begin="23" end="23" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH24" description="Channel 24 was the source of DMA_INT0" begin="24" end="24" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH25" description="Channel 25 was the source of DMA_INT0" begin="25" end="25" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH26" description="Channel 26 was the source of DMA_INT0" begin="26" end="26" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH27" description="Channel 27 was the source of DMA_INT0" begin="27" end="27" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH28" description="Channel 28 was the source of DMA_INT0" begin="28" end="28" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH29" description="Channel 29 was the source of DMA_INT0" begin="29" end="29" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH30" description="Channel 30 was the source of DMA_INT0" begin="30" end="30" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CH31" description="Channel 31 was the source of DMA_INT0" begin="31" end="31" width="1" rwaccess="R">
        </bitfield>
    </register>
