Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/DMA_356.0.xml
    <register id="DMA_INT0_CLRFLG" width="32" offset="0x114" internal="0" description="Interrupt 0 Source Channel Clear Flag Register">
        <bitfield id="CH0" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH1" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH2" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH3" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH4" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH5" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH6" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH7" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH8" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH9" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH10" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH11" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH12" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="12" end="12" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH13" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="13" end="13" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH14" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH15" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH16" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="16" end="16" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH17" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="17" end="17" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH18" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="18" end="18" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH19" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="19" end="19" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH20" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="20" end="20" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH21" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="21" end="21" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH22" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="22" end="22" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH23" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="23" end="23" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH24" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="24" end="24" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH25" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="25" end="25" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH26" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="26" end="26" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH27" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="27" end="27" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH28" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="28" end="28" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH29" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH30" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="30" end="30" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="CH31" description="Clear corresponding DMA_INT0_SRCFLG_REG" begin="31" end="31" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_STAT" width="32" offset="0x1000" internal="0" description="Status Register">
        <bitfield id="MASTEN" description="Enable status of the controller" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="MASTEN_0" value="0x0" description="Controller disabled"/>
            <bitenum id="MASTEN_1" value="0x1" description="Controller enabled"/>
        </bitfield>
        <bitfield id="STATE" description="Current state of the control state machine. State can be one of the following:" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="STATE_0" value="0x0" description="idle"/>
            <bitenum id="STATE_1" value="0x1" description="reading channel controller data"/>
            <bitenum id="STATE_2" value="0x2" description="reading source data end pointer"/>
            <bitenum id="STATE_3" value="0x3" description="reading destination data end pointer"/>
            <bitenum id="STATE_4" value="0x4" description="reading source data"/>
            <bitenum id="STATE_5" value="0x5" description="writing destination data"/>
            <bitenum id="STATE_6" value="0x6" description="waiting for DMA request to clear"/>
            <bitenum id="STATE_7" value="0x7" description="writing channel controller data"/>
            <bitenum id="STATE_8" value="0x8" description="stalled"/>
            <bitenum id="STATE_9" value="0x9" description="done"/>
            <bitenum id="STATE_10" value="0xA" description="peripheral scatter-gather transition"/>
            <bitenum id="STATE_11" value="0xB" description="Reserved"/>
            <bitenum id="STATE_12" value="0xC" description="Reserved"/>
            <bitenum id="STATE_13" value="0xD" description="Reserved"/>
            <bitenum id="STATE_14" value="0xE" description="Reserved"/>
            <bitenum id="STATE_15" value="0xF" description="Reserved"/>
        </bitfield>
        <bitfield id="DMACHANS" description="Number of available DMA channels minus one." begin="20" end="16" width="5" rwaccess="R">
            <bitenum id="DMACHANS_0" value="0x0" description="Controller configured to use 1 DMA channel"/>
            <bitenum id="DMACHANS_1" value="0x1" description="Controller configured to use 2 DMA channels"/>
            <bitenum id="DMACHANS_30" value="0x1E" description="Controller configured to use 31 DMA channels"/>
            <bitenum id="DMACHANS_31" value="0x1F" description="Controller configured to use 32 DMA channels"/>
        </bitfield>
        <bitfield id="TESTSTAT" description="To reduce the gate count the controller can be configured to exclude the integration test logic. The values 2h to Fh are Reserved." begin="31" end="28" width="4" rwaccess="R">
            <bitenum id="TESTSTAT_0" value="0x0" description="Controller does not include the integration test logic"/>
            <bitenum id="TESTSTAT_1" value="0x1" description="Controller includes the integration test logic"/>
        </bitfield>
    </register>
    <register id="DMA_CFG" width="32" offset="0x1004" internal="0" description="Configuration Register">
        <bitfield id="MASTEN" description="Enable status of the controller" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="MASTEN_0" value="0x0" description="Controller disabled"/>
            <bitenum id="MASTEN_1" value="0x1" description="Controller enabled"/>
        </bitfield>
        <bitfield id="CHPROTCTRL" description="Sets the AHB-Lite protection by controlling the HPROT[3:1] signal levels as follows: Bit [7] Controls HPROT[3] to indicate if a cacheable access is occurring. Bit [6] Controls HPROT[2] to indicate if a bufferable access is occurring. Bit [5] Controls HPROT[1] to indicate if a privileged access is occurring. Note: When bit [n] = 1 then the corresponding HPROT is HIGH. When bit [n] = 0 then the corresponding HPROT is LOW." begin="7" end="5" width="3" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_CTLBASE" width="32" offset="0x1008" internal="0" description="Channel Control Data Base Pointer Register">
        <bitfield id="ADDR" description="Pointer to the base address of the primary data structure." begin="31" end="5" width="27" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="DMA_ALTBASE" width="32" offset="0x100C" internal="0" description="Channel Alternate Control Data Base Pointer Register">
    </register>
    <register id="DMA_WAITSTAT" width="32" offset="0x1010" internal="0" description="Channel Wait on Request Status Register">
        <bitfield id="WAITREQ" description="Channel wait on request status." begin="31" end="0" width="32" rwaccess="R">
            <bitenum id="WAITREQ_0" value="0x0" description="dma_waitonreq[C] is LOW."/>
            <bitenum id="WAITREQ_1" value="0x1" description="dma_waitonreq[C] is HIGH."/>
        </bitfield>
    </register>
    <register id="DMA_SWREQ" width="32" offset="0x1014" internal="0" description="Channel Software Request Register">
        <bitfield id="CHNL_SW_REQ" description="Set the appropriate bit to generate a software DMA request on the corresponding DMA channel. Writing to a bit where a DMA channel is not implemented does not create a DMA request for that channel." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="CHNL_SW_REQ_0" value="0x0" description="Does not create a DMA request for the channel"/>
            <bitenum id="CHNL_SW_REQ_1" value="0x1" description="Creates a DMA request for the channel"/>
        </bitfield>
    </register>
