Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/DMA_356.0.xml
    <register id="DMA_USEBURSTSET" width="32" offset="0x1018" internal="0" description="Channel Useburst Set Register">
        <bitfield id="SET" description="Returns the useburst status, or disables dma_sreq from generating DMA requests." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="SET_0_READ" value="0x0" description="DMA channel C responds to requests that it receives on dma_req[C] or dma_sreq[C]. The controller performs 2R, or single, bus transfers."/>
            <bitenum id="SET_0_WRITE" value="0x0" description="No effect. Use the DMA_USEBURST_CLR Register to set bit [C] to 0."/>
            <bitenum id="SET_1_READ" value="0x1" description="DMA channel C does not respond to requests that it receives on dma_sreq[C]. The controller only responds to dma_req[C] requests and performs 2R transfers."/>
            <bitenum id="SET_1_WRITE" value="0x1" description="Disables dma_sreq[C] from generating DMA requests. The controller performs 2R transfers. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_USEBURSTCLR" width="32" offset="0x101C" internal="0" description="Channel Useburst Clear Register">
        <bitfield id="CLR" description="Set the appropriate bit to enable dma_sreq to generate requests." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="CLR_0" value="0x0" description="No effect. Use the DMA_USEBURST_SET Register to disable dma_sreq from generating requests."/>
            <bitenum id="CLR_1" value="0x1" description="Enables dma_sreq[C] to generate DMA requests. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_REQMASKSET" width="32" offset="0x1020" internal="0" description="Channel Request Mask Set Register">
        <bitfield id="SET" description="Returns the request mask status of dma_req and dma_sreq, or disables the corresponding channel from generating DMA requests." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="SET_0_READ" value="0x0" description="External requests are enabled for channel C."/>
            <bitenum id="SET_0_WRITE" value="0x0" description="No effect. Use the DMA_REQMASKCLR Register to enable DMA requests."/>
            <bitenum id="SET_1_READ" value="0x1" description="External requests are disabled for channel C."/>
            <bitenum id="SET_1_WRITE" value="0x1" description="Disables dma_req[C] and dma_sreq[C] from generating DMA requests. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_REQMASKCLR" width="32" offset="0x1024" internal="0" description="Channel Request Mask Clear Register">
        <bitfield id="CLR" description="Set the appropriate bit to enable DMA requests for the channel corresponding to dma_req and dma_sreq." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="CLR_0" value="0x0" description="No effect. Use the DMA_REQMASKSET Register to disable dma_req and dma_sreq from generating requests."/>
            <bitenum id="CLR_1" value="0x1" description="Enables dma_req[C] or dma_sreq[C] to generate DMA requests. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_ENASET" width="32" offset="0x1028" internal="0" description="Channel Enable Set Register">
        <bitfield id="SET" description="Returns the enable status of the channels, or enables the corresponding channels." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="SET_0_READ" value="0x0" description="Channel C is disabled."/>
            <bitenum id="SET_0_WRITE" value="0x0" description="No effect. Use the DMA_ENACLR Register to disable a channel."/>
            <bitenum id="SET_1_READ" value="0x1" description="Channel C is enabled."/>
            <bitenum id="SET_1_WRITE" value="0x1" description="Enables channel C. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_ENACLR" width="32" offset="0x102C" internal="0" description="Channel Enable Clear Register">
        <bitfield id="CLR" description="Set the appropriate bit to disable the corresponding DMA channel. Note: The controller disables a channel, by setting the appropriate bit, when: a) it completes the DMA cycle b) it reads a channel_cfg memory location which has cycle_ctrl = b000 c) an ERROR occurs on the AHB-Lite bus." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="CLR_0" value="0x0" description="No effect. Use the DMA_ENASET Register to enable DMA channels."/>
            <bitenum id="CLR_1" value="0x1" description="Disables channel C. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_ALTSET" width="32" offset="0x1030" internal="0" description="Channel Primary-Alternate Set Register">
        <bitfield id="SET" description="Channel Primary-Alternate Set Register" begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="SET_0_READ" value="0x0" description="DMA channel C is using the primary data structure."/>
            <bitenum id="SEL_0_WRITE" value="0x0" description="No effect. Use the DMA_ALTCLR Register to set bit [C] to 0."/>
            <bitenum id="SET_1_READ" value="0x1" description="DMA channel C is using the alternate data structure."/>
            <bitenum id="SEL_1_WRITE" value="0x1" description="Selects the alternate data structure for channel C. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_ALTCLR" width="32" offset="0x1034" internal="0" description="Channel Primary-Alternate Clear Register">
        <bitfield id="CLR" description="Channel Primary-Alternate Clear Register" begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="CLR_0" value="0x0" description="No effect. Use the DMA_ALTSET Register to select the alternate data structure."/>
            <bitenum id="CLR_1" value="0x1" description="Selects the primary data structure for channel C. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_PRIOSET" width="32" offset="0x1038" internal="0" description="Channel Priority Set Register">
        <bitfield id="SET" description="Returns the channel priority mask status, or sets the channel priority to high." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="SET_0_READ" value="0x0" description="DMA channel C is using the default priority level."/>
            <bitenum id="SET_0_WRITE" value="0x0" description="No effect. Use the DMA_PRIOCLR Register to set channel C to the default priority level."/>
            <bitenum id="SET_1_READ" value="0x1" description="DMA channel C is using a high priority level."/>
            <bitenum id="SET_1_WRITE" value="0x1" description="Channel C uses the high priority level. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
