Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/DMA_356.0.xml
    <register id="DMA_PRIOCLR" width="32" offset="0x103C" internal="0" description="Channel Priority Clear Register">
        <bitfield id="CLR" description="Set the appropriate bit to select the default priority level for the specified DMA channel." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="CLR_0" value="0x0" description="No effect. Use the DMA_PRIOSET Register to set channel C to the high priority level."/>
            <bitenum id="CLR_1" value="0x1" description="Channel C uses the default priority level. Writing to a bit where a DMA channel is not implemented has no effect."/>
        </bitfield>
    </register>
    <register id="DMA_ERRCLR" width="32" offset="0x104C" internal="0" description="Bus Error Clear Register">
        <bitfield id="ERRCLR" description="Returns the status of dma_err, or sets the signal LOW.  For test purposes, use the ERRSET register to set dma_err HIGH. Note: If you deassert dma_err at the same time as an ERROR occurs on the AHB-Lite bus, then the ERROR condition takes precedence and dma_err remains asserted." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ERRCLR_0_WRITE" value="0x0" description="No effect, status of dma_err is unchanged."/>
            <bitenum id="ERRCLR_0_READ" value="0x0" description="dma_err is LOW"/>
            <bitenum id="ERRCLR_1_READ" value="0x1" description="dma_err is HIGH."/>
            <bitenum id="ERRCLR_1_WRITE" value="0x1" description="Sets dma_err LOW."/>
        </bitfield>
    </register>
</module>
